[
  {
    "id": "sa1",
    "studentId": "STU001",
    "studentName": "Alice Johnson",
    "answer": "I discovered that JavaScript's event loop is single-threaded but uses a callback queue to handle async operations. This completely changed my understanding of how setTimeout and promises work!",
    "questionId": "q1",
    "submittedAt": "2024-12-26T10:30:00Z"
  },
  {
    "id": "sa2",
    "studentId": "STU002",
    "studentName": "Bob Smith",
    "answer": "The most surprising thing was learning about CSS specificity rules. I couldn't figure out why my styles weren't applying until I understood how ID selectors override class selectors.",
    "questionId": "q1",
    "submittedAt": "2024-12-26T11:15:00Z"
  },
  {
    "id": "sa3",
    "studentId": "STU003",
    "studentName": "Carol Williams",
    "answer": "I was amazed to learn that React's virtual DOM uses a diffing algorithm to minimize actual DOM updates. This explains why React apps are so performant despite frequent re-renders!",
    "questionId": "q1",
    "submittedAt": "2024-12-26T09:45:00Z"
  },
  {
    "id": "sa4",
    "studentId": "STU004",
    "studentName": "David Brown",
    "answer": "I struggled with understanding promises until I learned about microtask queue. Now I know why promise callbacks run before setTimeout callbacks, even if setTimeout is called first!",
    "questionId": "q2",
    "submittedAt": "2024-12-26T14:20:00Z"
  },
  {
    "id": "sa5",
    "studentId": "STU005",
    "studentName": "Emma Davis",
    "answer": "My biggest challenge was debugging a memory leak in my React app. I learned that useEffect cleanup functions are crucial for removing event listeners and preventing memory issues.",
    "questionId": "q2",
    "submittedAt": "2024-12-25T10:00:00Z"
  },
  {
    "id": "sa6",
    "studentId": "STU006",
    "studentName": "Frank Miller",
    "answer": "I overcame my fear of algorithms by implementing a hash table from scratch. Understanding how collisions are resolved with chaining made data structures click for me!",
    "questionId": "q2",
    "submittedAt": "2024-12-25T11:30:00Z"
  },
  {
    "id": "sa7",
    "studentId": "STU007",
    "studentName": "Grace Wilson",
    "answer": "I want to master Next.js next. I've already built a few React apps, and learning about server-side rendering and static generation seems like natural progression.",
    "questionId": "q3",
    "submittedAt": "2024-12-26T13:00:00Z"
  },
  {
    "id": "sa8",
    "studentId": "STU008",
    "studentName": "Henry Taylor",
    "answer": "My next goal is to learn Docker and containerization. Understanding how to package applications consistently across different environments will make me a more versatile developer.",
    "questionId": "q3",
    "submittedAt": "2024-12-26T14:15:00Z"
  },
  {
    "id": "sa9",
    "studentId": "STU009",
    "studentName": "Isabella Martinez",
    "answer": "I'm focusing on GraphQL next. REST APIs are great, but GraphQL's ability to request exactly what you need and prevent over-fetching seems revolutionary for frontend development.",
    "questionId": "q3",
    "submittedAt": "2024-12-26T15:30:00Z"
  },
  {
    "id": "sa10",
    "studentId": "STU010",
    "studentName": "Jack Anderson",
    "answer": "Learning about WebAssembly blew my mind! The fact that we can run languages like Rust and C++ directly in browser opens up so many possibilities for web development.",
    "questionId": "1767338064136",
    "submittedAt": "2026-01-02T09:00:00Z"
  },
  {
    "id": "sa11",
    "studentId": "STU011",
    "studentName": "Katherine Thomas",
    "answer": "I discovered that CSS Grid and Flexbox work better together than separately. Using Grid for overall layout and Flexbox for component alignment has made my responsive designs so much cleaner!",
    "questionId": "1767338064136",
    "submittedAt": "2026-01-02T10:15:00Z"
  },
  {
    "id": "sa12",
    "studentId": "STU012",
    "studentName": "Liam Jackson",
    "answer": "The most surprising discovery was learning about browser's rendering pipeline. Understanding how CSS triggers layout, paint, and composite phases helped me optimize animations for 60fps performance!",
    "questionId": "1767338064136",
    "submittedAt": "2026-01-02T11:30:00Z"
  },
  {
    "id": "sa13",
    "studentId": "STU013",
    "studentName": "Mia White",
    "answer": "I struggled with understanding Redux middleware until I built my own custom middleware. Seeing how actions flow through the chain made the concept click perfectly.",
    "questionId": "1767338069161",
    "submittedAt": "2026-01-02T12:45:00Z"
  },
  {
    "id": "sa14",
    "studentId": "STU014",
    "studentName": "Noah Harris",
    "answer": "My breakthrough came when I learned about JavaScript's prototype chain. Understanding that objects are linked through prototypes rather than copied made inheritance finally make sense!",
    "questionId": "1767338069161",
    "submittedAt": "2026-01-02T13:00:00Z"
  },
  {
    "id": "sa15",
    "studentId": "STU015",
    "studentName": "Olivia Martin",
    "answer": "I overcame my confusion about async JavaScript by building a promise polyfill from scratch. Understanding the A+ specification and how promises resolve asynchronously was eye-opening!",
    "questionId": "1767338069161",
    "submittedAt": "2026-01-02T14:15:00Z"
  }
]
