[
  {
    "id": "c1",
    "questionId": "1767338064136",
    "studentId": "STU007",
    "studentName": "Grace Wilson",
    "comment": "This question really made me think about how I approach learning new technologies. I've been trying to be more intentional about understanding the 'why' behind concepts rather than just memorizing syntax.",
    "submittedAt": "2026-01-02T09:00:00Z"
  },
  {
    "id": "c2",
    "questionId": "1767338064136",
    "studentId": "STU009",
    "studentName": "Isabella Martinez",
    "comment": "Great question! I discovered that learning about event bubbling helped me solve a persistent bug in my React project. Sometimes the most surprising discoveries come from debugging!",
    "submittedAt": "2026-01-02T10:15:00Z"
  },
  {
    "id": "c3",
    "questionId": "1767338069161",
    "studentId": "STU008",
    "studentName": "Henry Taylor",
    "comment": "I struggled with scope rules for weeks. What helped me was drawing diagrams of the execution context and visualizing how variables are stored in different scopes.",
    "submittedAt": "2026-01-02T11:30:00Z"
  },
  {
    "id": "c4",
    "questionId": "1767338069161",
    "studentId": "STU010",
    "studentName": "Jack Anderson",
    "comment": "This reminds me of when I first learned about hoisting. It seemed so counterintuitive until I understood that JavaScript moves declarations to the top during compilation.",
    "submittedAt": "2026-01-02T12:45:00Z"
  },
  {
    "id": "c5",
    "questionId": "q1",
    "studentId": "STU011",
    "studentName": "Katherine Thomas",
    "comment": "The most surprising thing I learned this week was about CSS Grid. I always thought it was complicated, but it's actually much more intuitive than Flexbox for complex layouts!",
    "submittedAt": "2024-12-26T13:00:00Z"
  },
  {
    "id": "c6",
    "questionId": "q1",
    "studentId": "STU012",
    "studentName": "Liam Jackson",
    "comment": "I was amazed to learn that JavaScript is single-threaded but can handle async operations through the event loop. It completely changed how I think about performance!",
    "submittedAt": "2024-12-26T14:15:00Z"
  },
  {
    "id": "c7",
    "questionId": "q2",
    "studentId": "STU013",
    "studentName": "Mia White",
    "comment": "I faced a huge challenge with understanding promises. What helped was breaking it down into micro-tasks and macro-tasks. Now async/await makes so much more sense!",
    "submittedAt": "2024-12-26T15:30:00Z"
  },
  {
    "id": "c8",
    "questionId": "q2",
    "studentId": "STU014",
    "studentName": "Noah Harris",
    "comment": "My biggest challenge was debugging a memory leak in my React app. I learned about cleanup functions in useEffect the hard way, but now I'm much more careful!",
    "submittedAt": "2024-12-26T16:45:00Z"
  },
  {
    "id": "c9",
    "questionId": "q3",
    "studentId": "STU015",
    "studentName": "Olivia Martin",
    "comment": "I want to develop my TypeScript skills next. I've already started by adding types to my existing JavaScript projects. It's catching so many bugs before they even happen!",
    "submittedAt": "2024-12-26T17:00:00Z"
  },
  {
    "id": "c10",
    "questionId": "q3",
    "studentId": "STU016",
    "studentName": "Penelope Garcia",
    "comment": "Next skill for me is definitely Node.js. I want to understand the full stack. I've started with Express.js and it's been eye-opening to see how the backend works!",
    "submittedAt": "2024-12-26T18:15:00Z"
  }
]
